CPE-Sim/inform.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
	<env:Header>
		<cwmp:ID env:mustUnderstand="1">3</cwmp:ID>
	</env:Header>
	<env:Body>
		<cwmp:Inform>
			<DeviceId>
				<Manufacturer>Pace, plc</Manufacturer>
				<OUI>000CC3</OUI>
				<ProductClass>V5480</ProductClass>
				<SerialNumber>190000047990940</SerialNumber>
			</DeviceId>
			<Event enc:arrayType="cwmp:EventStruct[1]">
				<EventStruct>
					<EventCode>2 PERIODIC</EventCode>
					<CommandKey/>
				</EventStruct>
			</Event>
			<MaxEnvelopes>1</MaxEnvelopes>
			<CurrentTime>2015-06-24T22:05:19</CurrentTime>
			<RetryCount>0</RetryCount>
			<ParameterList enc:arrayType="cwmp:ParameterValueStruct[10]">
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.DeviceSummary</Name>
					<Value xsi:type="xsd:string">InternetGatewayDevice:1.5[](Baseline:1,ADSLWAN:1,ADSL2WAN:1,VDSL2WAN:1,EthernetLAN:1,USBLAN:1,WiFiLAN:1,EthernetWAN:1,PTMWAN:1,Time:2,IPPing:1,TraceRoute:1,Download:1,DownloadTCP:1,Upload:1,UploadTCP:1,UDPEcho:1,UDPEchoPlus:1,DeviceAssociation:1,MemoryStatus:1,ProcessStatus:1,AutonXferComplPolicy:1,SimpleFirewall:1,PeriodicStatsBase:1,PeriodicStatsAdv:1,ATMLoopback:1),VoiceService:1.0[1](SIPEndpoint:1)</Value>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.DeviceInfo.HardwareVersion</Name>
					<Value xsi:type="xsd:string">B14301</Value>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.DeviceInfo.SoftwareVersion</Name>
					<Value xsi:type="xsd:string">B14301-Generic-RC-98762-test</Value>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.DeviceInfo.SpecVersion</Name>
					<Value xsi:type="xsd:string">2.0</Value>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.DeviceInfo.ProvisioningCode</Name>
					<Value xsi:type="xsd:string"/>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.ManagementServer.ParameterKey</Name>
					<Value xsi:type="xsd:string"/>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.ManagementServer.ConnectionRequestURL</Name>
					<Value xsi:type="xsd:string">http://10.37.82.32:7547/29149923</Value>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.ManagementServer.UDPConnectionRequestAddress</Name>
					<Value xsi:type="xsd:string"/>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.ManagementServer.ConnReqJabberID</Name>
					<Value xsi:type="xsd:string">000CC3-190000047990940@xmpp-konnect.pacemgmt.com/K2wAd6UZ8E0nKkpy9F4W</Value>
				</ParameterValueStruct>
				<ParameterValueStruct>
					<Name>InternetGatewayDevice.WANDevice.1.WANConnectionDevice.1.WANIPConnection.1.ExternalIPAddress</Name>
					<Value xsi:type="xsd:string">10.37.82.32</Value>
				</ParameterValueStruct>
			</ParameterList>
		</cwmp:Inform>
	</env:Body>
</env:Envelope>
